HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxPort_bf.h
/** \brief Offset for Ifx_P_OMR_Bits.PCL15 */
#define IFX_P_OMR_PCL15_OFF (31u)

/** \brief Length for Ifx_P_ID_Bits.MODREV */
#define IFX_P_ID_MODREV_LEN (8u)

/** \brief Mask for Ifx_P_ID_Bits.MODREV */
#define IFX_P_ID_MODREV_MSK (0xffu)

/** \brief Offset for Ifx_P_ID_Bits.MODREV */
#define IFX_P_ID_MODREV_OFF (0u)

/** \brief Length for Ifx_P_ID_Bits.MODTYPE */
#define IFX_P_ID_MODTYPE_LEN (8u)

/** \brief Mask for Ifx_P_ID_Bits.MODTYPE */
#define IFX_P_ID_MODTYPE_MSK (0xffu)

/** \brief Offset for Ifx_P_ID_Bits.MODTYPE */
#define IFX_P_ID_MODTYPE_OFF (8u)

/** \brief Length for Ifx_P_ID_Bits.MODNUMBER */
#define IFX_P_ID_MODNUMBER_LEN (16u)

/** \brief Mask for Ifx_P_ID_Bits.MODNUMBER */
#define IFX_P_ID_MODNUMBER_MSK (0xffffu)

/** \brief Offset for Ifx_P_ID_Bits.MODNUMBER */
#define IFX_P_ID_MODNUMBER_OFF (16u)

/** \brief Length for Ifx_P_IOCR0_Bits.PC0 */
#define IFX_P_IOCR0_PC0_LEN (5u)

/** \brief Mask for Ifx_P_IOCR0_Bits.PC0 */
#define IFX_P_IOCR0_PC0_MSK (0x1fu)

/** \brief Offset for Ifx_P_IOCR0_Bits.PC0 */
#define IFX_P_IOCR0_PC0_OFF (3u)

/** \brief Length for Ifx_P_IOCR0_Bits.PC1 */
#define IFX_P_IOCR0_PC1_LEN (5u)

/** \brief Mask for Ifx_P_IOCR0_Bits.PC1 */
#define IFX_P_IOCR0_PC1_MSK (0x1fu)

/** \brief Offset for Ifx_P_IOCR0_Bits.PC1 */
#define IFX_P_IOCR0_PC1_OFF (11u)

/** \brief Length for Ifx_P_IOCR0_Bits.PC2 */
#define IFX_P_IOCR0_PC2_LEN (5u)

/** \brief Mask for Ifx_P_IOCR0_Bits.PC2 */
#define IFX_P_IOCR0_PC2_MSK (0x1fu)

/** \brief Offset for Ifx_P_IOCR0_Bits.PC2 */
#define IFX_P_IOCR0_PC2_OFF (19u)

/** \brief Length for Ifx_P_IOCR0_Bits.PC3 */
#define IFX_P_IOCR0_PC3_LEN (5u)

/** \brief Mask for Ifx_P_IOCR0_Bits.PC3 */
#define IFX_P_IOCR0_PC3_MSK (0x1fu)

/** \brief Offset for Ifx_P_IOCR0_Bits.PC3 */
#define IFX_P_IOCR0_PC3_OFF (27u)

/** \brief Length for Ifx_P_IOCR4_Bits.PC4 */
#define IFX_P_IOCR4_PC4_LEN (5u)

/** \brief Mask for Ifx_P_IOCR4_Bits.PC4 */
#define IFX_P_IOCR4_PC4_MSK (0x1fu)

/** \brief Offset for Ifx_P_IOCR4_Bits.PC4 */
#define IFX_P_IOCR4_PC4_OFF (3u)

/** \brief Length for Ifx_P_IOCR4_Bits.PC5 */
#define IFX_P_IOCR4_PC5_LEN (5u)

/** \brief Mask for Ifx_P_IOCR4_Bits.PC5 */
#define IFX_P_IOCR4_PC5_MSK (0x1fu)

/** \brief Offset for Ifx_P_IOCR4_Bits.PC5 */
#define IFX_P_IOCR4_PC5_OFF (11u)

/** \brief Length for Ifx_P_IOCR4_Bits.PC6 */
#define IFX_P_IOCR4_PC6_LEN (5u)

/** \brief Mask for Ifx_P_IOCR4_Bits.PC6 */
#define IFX_P_IOCR4_PC6_MSK (0x1fu)

/** \brief Offset for Ifx_P_IOCR4_Bits.PC6 */
#define IFX_P_IOCR4_PC6_OFF (19u)

/** \brief Length for Ifx_P_IOCR4_Bits.PC7 */
#define IFX_P_IOCR4_PC7_LEN (5u)

/** \brief Mask for Ifx_P_IOCR4_Bits.PC7 */
#define IFX_P_IOCR4_PC7_MSK (0x1fu)

/** \brief Offset for Ifx_P_IOCR4_Bits.PC7 */
#define IFX_P_IOCR4_PC7_OFF (27u)

/** \brief Length for Ifx_P_IOCR8_Bits.PC8 */
#define IFX_P_IOCR8_PC8_LEN (5u)

/** \brief Mask for Ifx_P_IOCR8_Bits.PC8 */
#define IFX_P_IOCR8_PC8_MSK (0x1fu)

/** \brief Offset for Ifx_P_IOCR8_Bits.PC8 */
#define IFX_P_IOCR8_PC8_OFF (3u)

/** \brief Length for Ifx_P_IOCR8_Bits.PC9 */
#define IFX_P_IOCR8_PC9_LEN (5u)

/** \brief Mask for Ifx_P_IOCR8_Bits.PC9 */
#define IFX_P_IOCR8_PC9_MSK (0x1fu)

/** \brief Offset for Ifx_P_IOCR8_Bits.PC9 */
#define IFX_P_IOCR8_PC9_OFF (11u)

/** \brief Length for Ifx_P_IOCR8_Bits.PC10 */
#define IFX_P_IOCR8_PC10_LEN (5u)

/** \brief Mask for Ifx_P_IOCR8_Bits.PC10 */
#define IFX_P_IOCR8_PC10_MSK (0x1fu)

/** \brief Offset for Ifx_P_IOCR8_Bits.PC10 */
#define IFX_P_IOCR8_PC10_OFF (19u)

/** \brief Length for Ifx_P_IOCR8_Bits.PC11 */
#define IFX_P_IOCR8_PC11_LEN (5u)

/** \brief Mask for Ifx_P_IOCR8_Bits.PC11 */
#define IFX_P_IOCR8_PC11_MSK (0x1fu)

/** \brief Offset for Ifx_P_IOCR8_Bits.PC11 */
#define IFX_P_IOCR8_PC11_OFF (27u)

/** \brief Length for Ifx_P_IOCR12_Bits.PC12 */
#define IFX_P_IOCR12_PC12_LEN (5u)

/** \brief Mask for Ifx_P_IOCR12_Bits.PC12 */
#define IFX_P_IOCR12_PC12_MSK (0x1fu)

/** \brief Offset for Ifx_P_IOCR12_Bits.PC12 */
#define IFX_P_IOCR12_PC12_OFF (3u)

/** \brief Length for Ifx_P_IOCR12_Bits.PC13 */
#define IFX_P_IOCR12_PC13_LEN (5u)

/** \brief Mask for Ifx_P_IOCR12_Bits.PC13 */
#define IFX_P_IOCR12_PC13_MSK (0x1fu)

/** \brief Offset for Ifx_P_IOCR12_Bits.PC13 */
#define IFX_P_IOCR12_PC13_OFF (11u)

/** \brief Length for Ifx_P_IOCR12_Bits.PC14 */
#define IFX_P_IOCR12_PC14_LEN (5u)

/** \brief Mask for Ifx_P_IOCR12_Bits.PC14 */
#define IFX_P_IOCR12_PC14_MSK (0x1fu)

/** \brief Offset for Ifx_P_IOCR12_Bits.PC14 */
#define IFX_P_IOCR12_PC14_OFF (19u)

/** \brief Length for Ifx_P_IOCR12_Bits.PC15 */
#define IFX_P_IOCR12_PC15_LEN (5u)

/** \brief Mask for Ifx_P_IOCR12_Bits.PC15 */
#define IFX_P_IOCR12_PC15_MSK (0x1fu)

/** \brief Offset for Ifx_P_IOCR12_Bits.PC15 */
#define IFX_P_IOCR12_PC15_OFF (27u)

/** \brief Length for Ifx_P_IN_Bits.P0 */
#define IFX_P_IN_P0_LEN (1u)

/** \brief Mask for Ifx_P_IN_Bits.P0 */
#define IFX_P_IN_P0_MSK (0x1u)

/** \brief Offset for Ifx_P_IN_Bits.P0 */
#define IFX_P_IN_P0_OFF (0u)

/** \brief Length for Ifx_P_IN_Bits.P1 */
#define IFX_P_IN_P1_LEN (1u)

/** \brief Mask for Ifx_P_IN_Bits.P1 */
#define IFX_P_IN_P1_MSK (0x1u)

/** \brief Offset for Ifx_P_IN_Bits.P1 */
#define IFX_P_IN_P1_OFF (1u)

/** \brief Length for Ifx_P_IN_Bits.P2 */
#define IFX_P_IN_P2_LEN (1u)

/** \brief Mask for Ifx_P_IN_Bits.P2 */
#define IFX_P_IN_P2_MSK (0x1u)

/** \brief Offset for Ifx_P_IN_Bits.P2 */
#define IFX_P_IN_P2_OFF (2u)

/** \brief Length for Ifx_P_IN_Bits.P3 */
#define IFX_P_IN_P3_LEN (1u)

/** \brief Mask for Ifx_P_IN_Bits.P3 */
#define IFX_P_IN_P3_MSK (0x1u)

/** \brief Offset for Ifx_P_IN_Bits.P3 */
#define IFX_P_IN_P3_OFF (3u)

/** \brief Length for Ifx_P_IN_Bits.P4 */
#define IFX_P_IN_P4_LEN (1u)

/** \brief Mask for Ifx_P_IN_Bits.P4 */
#define IFX_P_IN_P4_MSK (0x1u)

/** \brief Offset for Ifx_P_IN_Bits.P4 */
#define IFX_P_IN_P4_OFF (4u)

/** \brief Length for Ifx_P_IN_Bits.P5 */
#define IFX_P_IN_P5_LEN (1u)

/** \brief Mask for Ifx_P_IN_Bits.P5 */
#define IFX_P_IN_P5_MSK (0x1u)

/** \brief Offset for Ifx_P_IN_Bits.P5 */
#define IFX_P_IN_P5_OFF (5u)

/** \brief Length for Ifx_P_IN_Bits.P6 */
#define IFX_P_IN_P6_LEN (1u)

/** \brief Mask for Ifx_P_IN_Bits.P6 */
#define IFX_P_IN_P6_MSK (0x1u)

